#!/bin/bash

read -p "İp_Adress:  " IP
read -p 'Web_Name (example > test.com) :   '  WEB
echo



nmapscan(){
	 nmap -sS -sV -p- -A $IP
}
nmapscan

echo '***********************************************************************

𝕒𝕝𝕡𝕖𝕣𝕖𝕟 𝕦𝕘𝕦𝕣𝕝𝕦 --> 𝕔𝕠𝕟𝕥𝕒𝕔𝕥: | 𝕙𝕥𝕥𝕡𝕤://𝕨𝕨𝕨.𝕝𝕚𝕟𝕜𝕖𝕕𝕚𝕟.𝕔𝕠𝕞/𝕚𝕟/𝕒𝕝𝕡𝕖𝕣𝕖𝕟-𝕦-𝟟𝕓𝟝𝟟𝕓𝟟𝟙𝟟𝟠/

***********************************************************************'

dirbscan (){
	dirb http://$IP
}
dirbscan


gobusterscan (){
	gobuster dir --url http://$IP -w /usr/share/dirb/wordlists/big.txt
}
gobusterscan

echo '***********************************************************************

𝕒𝕝𝕡𝕖𝕣𝕖𝕟 𝕦𝕘𝕦𝕣𝕝𝕦 --> 𝕔𝕠𝕟𝕥𝕒𝕔𝕥: | 𝕙𝕥𝕥𝕡𝕤://𝕨𝕨𝕨.𝕝𝕚𝕟𝕜𝕖𝕕𝕚𝕟.𝕔𝕠𝕞/𝕚𝕟/𝕒𝕝𝕡𝕖𝕣𝕖𝕟-𝕦-𝟟𝕓𝟝𝟟𝕓𝟟𝟙𝟟𝟠/

***********************************************************************'


harvesterscan (){
	theHarvester -d $WEB -b google -l 500
}
harvesterscan

sqlmapscan(){
	sqlmap -u $WEB --dbs
}
sqlmapscan


echo '***********************************************************************

𝕒𝕝𝕡𝕖𝕣𝕖𝕟 𝕦𝕘𝕦𝕣𝕝𝕦 --> 𝕔𝕠𝕟𝕥𝕒𝕔𝕥: | 𝕙𝕥𝕥𝕡𝕤://𝕨𝕨𝕨.𝕝𝕚𝕟𝕜𝕖𝕕𝕚𝕟.𝕔𝕠𝕞/𝕚𝕟/𝕒𝕝𝕡𝕖𝕣𝕖𝕟-𝕦-𝟟𝕓𝟝𝟟𝕓𝟟𝟙𝟟𝟠/

***********************************************************************'







